{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 7, 7, 1], "dtype": "float32", "sparse": false, "name": "ONT1_input"}, "name": "ONT1_input", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "ONT1_hidden_pre_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT1_hidden_pre_bn", "inbound_nodes": [[["ONT1_input", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT1_hidden_pre_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT1_hidden_pre_ac", "inbound_nodes": [[["ONT1_hidden_pre_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT1_hidden_tower4a_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT1_hidden_tower4a_cv", "inbound_nodes": [[["ONT1_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT1_hidden_tower4a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT1_hidden_tower4a_bn", "inbound_nodes": [[["ONT1_hidden_tower4a_cv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT1_hidden_tower4a_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT1_hidden_tower4a_ac", "inbound_nodes": [[["ONT1_hidden_tower4a_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT1_hidden_tower3a_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT1_hidden_tower3a_cv", "inbound_nodes": [[["ONT1_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT1_hidden_tower4b_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT1_hidden_tower4b_cv", "inbound_nodes": [[["ONT1_hidden_tower4a_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT1_hidden_tower3a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT1_hidden_tower3a_bn", "inbound_nodes": [[["ONT1_hidden_tower3a_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT1_hidden_tower4b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT1_hidden_tower4b_bn", "inbound_nodes": [[["ONT1_hidden_tower4b_cv", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "ONT1_hidden_tower2a_mp", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "ONT1_hidden_tower2a_mp", "inbound_nodes": [[["ONT1_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT1_hidden_tower3a_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT1_hidden_tower3a_ac", "inbound_nodes": [[["ONT1_hidden_tower3a_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT1_hidden_tower4b_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT1_hidden_tower4b_ac", "inbound_nodes": [[["ONT1_hidden_tower4b_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT1_hidden_tower1_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT1_hidden_tower1_cv", "inbound_nodes": [[["ONT1_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT1_hidden_tower2b_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT1_hidden_tower2b_cv", "inbound_nodes": [[["ONT1_hidden_tower2a_mp", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT1_hidden_tower3b1_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT1_hidden_tower3b1_cv", "inbound_nodes": [[["ONT1_hidden_tower3a_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT1_hidden_tower3b2_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT1_hidden_tower3b2_cv", "inbound_nodes": [[["ONT1_hidden_tower3a_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT1_hidden_tower4c1_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT1_hidden_tower4c1_cv", "inbound_nodes": [[["ONT1_hidden_tower4b_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT1_hidden_tower4c2_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT1_hidden_tower4c2_cv", "inbound_nodes": [[["ONT1_hidden_tower4b_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT1_hidden_tower1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT1_hidden_tower1_bn", "inbound_nodes": [[["ONT1_hidden_tower1_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT1_hidden_tower2b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT1_hidden_tower2b_bn", "inbound_nodes": [[["ONT1_hidden_tower2b_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT1_hidden_tower3b1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT1_hidden_tower3b1_bn", "inbound_nodes": [[["ONT1_hidden_tower3b1_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT1_hidden_tower3b2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT1_hidden_tower3b2_bn", "inbound_nodes": [[["ONT1_hidden_tower3b2_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT1_hidden_tower4c1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT1_hidden_tower4c1_bn", "inbound_nodes": [[["ONT1_hidden_tower4c1_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT1_hidden_tower4c2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT1_hidden_tower4c2_bn", "inbound_nodes": [[["ONT1_hidden_tower4c2_cv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT1_hidden_towe1_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT1_hidden_towe1_ac", "inbound_nodes": [[["ONT1_hidden_tower1_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT1_hidden_tower2b_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT1_hidden_tower2b_ac", "inbound_nodes": [[["ONT1_hidden_tower2b_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT1_hidden_tower3b1_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT1_hidden_tower3b1_ac", "inbound_nodes": [[["ONT1_hidden_tower3b1_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT1_hidden_tower3b2_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT1_hidden_tower3b2_ac", "inbound_nodes": [[["ONT1_hidden_tower3b2_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT1_hidden_tower4c1_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT1_hidden_tower4c1_ac", "inbound_nodes": [[["ONT1_hidden_tower4c1_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT1_hidden_tower4c2_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT1_hidden_tower4c2_ac", "inbound_nodes": [[["ONT1_hidden_tower4c2_bn", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "ONT1_hidden_dc", "trainable": true, "dtype": "float32", "axis": -1}, "name": "ONT1_hidden_dc", "inbound_nodes": [[["ONT1_hidden_towe1_ac", 0, 0, {}], ["ONT1_hidden_tower2b_ac", 0, 0, {}], ["ONT1_hidden_tower3b1_ac", 0, 0, {}], ["ONT1_hidden_tower3b2_ac", 0, 0, {}], ["ONT1_hidden_tower4c1_ac", 0, 0, {}], ["ONT1_hidden_tower4c2_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT1_hidden_sc_cv", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT1_hidden_sc_cv", "inbound_nodes": [[["ONT1_hidden_dc", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "ONT1_hidden", "trainable": true, "dtype": "float32"}, "name": "ONT1_hidden", "inbound_nodes": [[["ONT1_hidden_sc_cv", 0, 0, {}], ["ONT1_input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT2_hidden_pre_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT2_hidden_pre_bn", "inbound_nodes": [[["ONT1_hidden", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT2_hidden_pre_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT2_hidden_pre_ac", "inbound_nodes": [[["ONT2_hidden_pre_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT2_hidden_tower4a_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT2_hidden_tower4a_cv", "inbound_nodes": [[["ONT2_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT2_hidden_tower4a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT2_hidden_tower4a_bn", "inbound_nodes": [[["ONT2_hidden_tower4a_cv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT2_hidden_tower4a_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT2_hidden_tower4a_ac", "inbound_nodes": [[["ONT2_hidden_tower4a_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT2_hidden_tower3a_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT2_hidden_tower3a_cv", "inbound_nodes": [[["ONT2_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT2_hidden_tower4b_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT2_hidden_tower4b_cv", "inbound_nodes": [[["ONT2_hidden_tower4a_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT2_hidden_tower3a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT2_hidden_tower3a_bn", "inbound_nodes": [[["ONT2_hidden_tower3a_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT2_hidden_tower4b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT2_hidden_tower4b_bn", "inbound_nodes": [[["ONT2_hidden_tower4b_cv", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "ONT2_hidden_tower2a_mp", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "ONT2_hidden_tower2a_mp", "inbound_nodes": [[["ONT2_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT2_hidden_tower3a_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT2_hidden_tower3a_ac", "inbound_nodes": [[["ONT2_hidden_tower3a_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT2_hidden_tower4b_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT2_hidden_tower4b_ac", "inbound_nodes": [[["ONT2_hidden_tower4b_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT2_hidden_tower1_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT2_hidden_tower1_cv", "inbound_nodes": [[["ONT2_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT2_hidden_tower2b_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT2_hidden_tower2b_cv", "inbound_nodes": [[["ONT2_hidden_tower2a_mp", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT2_hidden_tower3b1_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT2_hidden_tower3b1_cv", "inbound_nodes": [[["ONT2_hidden_tower3a_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT2_hidden_tower3b2_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT2_hidden_tower3b2_cv", "inbound_nodes": [[["ONT2_hidden_tower3a_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT2_hidden_tower4c1_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT2_hidden_tower4c1_cv", "inbound_nodes": [[["ONT2_hidden_tower4b_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT2_hidden_tower4c2_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT2_hidden_tower4c2_cv", "inbound_nodes": [[["ONT2_hidden_tower4b_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT2_hidden_tower1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT2_hidden_tower1_bn", "inbound_nodes": [[["ONT2_hidden_tower1_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT2_hidden_tower2b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT2_hidden_tower2b_bn", "inbound_nodes": [[["ONT2_hidden_tower2b_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT2_hidden_tower3b1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT2_hidden_tower3b1_bn", "inbound_nodes": [[["ONT2_hidden_tower3b1_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT2_hidden_tower3b2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT2_hidden_tower3b2_bn", "inbound_nodes": [[["ONT2_hidden_tower3b2_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT2_hidden_tower4c1_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT2_hidden_tower4c1_bn", "inbound_nodes": [[["ONT2_hidden_tower4c1_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT2_hidden_tower4c2_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT2_hidden_tower4c2_bn", "inbound_nodes": [[["ONT2_hidden_tower4c2_cv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT2_hidden_towe1_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT2_hidden_towe1_ac", "inbound_nodes": [[["ONT2_hidden_tower1_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT2_hidden_tower2b_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT2_hidden_tower2b_ac", "inbound_nodes": [[["ONT2_hidden_tower2b_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT2_hidden_tower3b1_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT2_hidden_tower3b1_ac", "inbound_nodes": [[["ONT2_hidden_tower3b1_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT2_hidden_tower3b2_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT2_hidden_tower3b2_ac", "inbound_nodes": [[["ONT2_hidden_tower3b2_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT2_hidden_tower4c1_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT2_hidden_tower4c1_ac", "inbound_nodes": [[["ONT2_hidden_tower4c1_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT2_hidden_tower4c2_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT2_hidden_tower4c2_ac", "inbound_nodes": [[["ONT2_hidden_tower4c2_bn", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "ONT2_hidden_dc", "trainable": true, "dtype": "float32", "axis": -1}, "name": "ONT2_hidden_dc", "inbound_nodes": [[["ONT2_hidden_towe1_ac", 0, 0, {}], ["ONT2_hidden_tower2b_ac", 0, 0, {}], ["ONT2_hidden_tower3b1_ac", 0, 0, {}], ["ONT2_hidden_tower3b2_ac", 0, 0, {}], ["ONT2_hidden_tower4c1_ac", 0, 0, {}], ["ONT2_hidden_tower4c2_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT2_hidden_sc_cv", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT2_hidden_sc_cv", "inbound_nodes": [[["ONT2_hidden_dc", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 7, 7, 1], "dtype": "float32", "sparse": false, "name": "ONT2_input"}, "name": "ONT2_input", "inbound_nodes": []}, {"class_name": "Add", "config": {"name": "ONT2_hidden", "trainable": true, "dtype": "float32"}, "name": "ONT2_hidden", "inbound_nodes": [[["ONT2_hidden_sc_cv", 0, 0, {}], ["ONT2_input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT3_hidden_pre_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT3_hidden_pre_bn", "inbound_nodes": [[["ONT2_hidden", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT3_hidden_pre_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT3_hidden_pre_ac", "inbound_nodes": [[["ONT3_hidden_pre_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT3_hidden_tower4a_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT3_hidden_tower4a_cv", "inbound_nodes": [[["ONT3_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT3_hidden_tower4a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT3_hidden_tower4a_bn", "inbound_nodes": [[["ONT3_hidden_tower4a_cv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT3_hidden_tower4a_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT3_hidden_tower4a_ac", "inbound_nodes": [[["ONT3_hidden_tower4a_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT3_hidden_tower3a_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT3_hidden_tower3a_cv", "inbound_nodes": [[["ONT3_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT3_hidden_tower4b_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT3_hidden_tower4b_cv", "inbound_nodes": [[["ONT3_hidden_tower4a_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT3_hidden_tower3a_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT3_hidden_tower3a_bn", "inbound_nodes": [[["ONT3_hidden_tower3a_cv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ONT3_hidden_tower4b_bn", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ONT3_hidden_tower4b_bn", "inbound_nodes": [[["ONT3_hidden_tower4b_cv", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "ONT3_hidden_tower2a_mp", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "ONT3_hidden_tower2a_mp", "inbound_nodes": [[["ONT3_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT3_hidden_tower3a_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT3_hidden_tower3a_ac", "inbound_nodes": [[["ONT3_hidden_tower3a_bn", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ONT3_hidden_tower4b_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ONT3_hidden_tower4b_ac", "inbound_nodes": [[["ONT3_hidden_tower4b_bn", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT3_hidden_tower1_cv", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": 888}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}, "name": "ONT3_hidden_tower1_cv", "inbound_nodes": [[["ONT3_hidden_pre_ac", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "config": {"name": "ONT3_hidden_tower2b_cv", "trainable": 